# Напишите программу, которая считывает с консоли числа
# (по одному в строке) до тех пор, пока сумма введённых
# чисел не будет равна 0 и сразу после этого выводит сумму
# квадратов всех считанных чисел.
# sum_1 = 0
# sum_2 = 0
# while True:
#    i = int(input())
#    sum_1 += i
#    sum_2 += i ** 2
#    if sum_1 == 0:
#        break
# print(sum_2)

# Напишите программу, которая считывает список чисел lst  из
# первой строки и число x  из второй строки, которая выводит все
# позиции, на которых встречается число x  в переданном списке lst .
# Позиции нумеруются с нуля, если число x x x не встречается в списке, вывести строку
#"Отсутствует"
#list_1 = [int(i) for i in input().split()]
#list_2 = []
#x = int(input())
#n = len(list_1)
#for i in range(n):
#    if x == list_1[i]:
#        print(i, end=' ')
#    else:
#        x != list_1[i]
#        list_2.append(list_1[i])
#        if len(list_1) == len(list_2):
#            print('Отсутствует')
